import { Component, OnInit } from '@angular/core';
import { NavComponent } from '../nav/nav.component';
import { NgFor } from '@angular/common';

@Component({
  selector: 'app-about-secton',
  standalone: true,
  imports: [NavComponent, NgFor],
  templateUrl: './about-secton.component.html',
  styleUrl: './about-secton.component.scss',
})
export class AboutSectonComponent {
  data: any[] = [
    {
      title: 'من نحن',
      text: 'في الوثق لخدمات الأعمال، نؤمن بأن النجاح المستدام يبدأ من تأسيس قوي مدعوم برؤية استراتيجية واضحة. نضع أنفسنا في موقع الشريك الاستراتيجي لعملائنا، نعمل على تحقيق التميز التشغيلي والنمو المستدام من خلال تقديم حلول شاملة ومتكاملة. نحن نلبي احتياجات ً ا من التأسيس وإعادة الهيكلة إلى تعزيز المنشآت بدء الكفاءة التشغيلية وضمان الاستدامة. نتميز بتقديم حلول مبتكرة تستند إلى أفضل الممارسات العالمية، مع فهم عميق لطبيعة السوق السعودي والإقليمي. بفضل فريقنا المؤهل وخبراتنا المتنوعة، نلتزم بتقديم استشارات احترافية تتخطى التوقعات، مع التركيز على التحول الرقمي وتطوير رأس المال البشري، مما يضمن تحقيق الأهداف بكفاءة وفعالية.',
    },
    {
      title: 'نبذه عنا',
      text: 'في الوثق لخدمات الأعمال، نسعى لأن نكون الشريك الأمثل لعملائنا في رحلتهم نحو التطوير والتميز. نقدم حلولاً متكاملة مصممة خصيصًا لتلبية احتياجات المنشآت في مختلف مراحل نموها، بدءًا من التخطيط والتأسيس إلى التطوير والاستدامة. نعتمد على نهج مبتكر يجمع بين أفضل الممارسات العالمية والمعرفة العميقة بالسوق المحلي، مما يمكننا من تقديم استشارات استراتيجية تدعم التحول الرقمي وتعزز الكفاءة التشغيلية. بفضل فريقنا المتخصص وخبراتنا المتراكمة، نلتزم بتمكين عملائنا من تحقيق أهدافهم بمرونة وفعالية، مع التركيز على تنمية رأس المال البشري وتعزيز القدرة التنافسية.',
    },
    {
      title: 'الملف التعريفي',
      text: 'الوثق لخدمات الأعمال هي مؤسسة متخصصة في تقديم الاستشارات والحلول الاستراتيجية التي تساعد الشركات على تحقيق النمو والاستدامة. نقدم خدماتنا بمستوى عالٍ من الاحترافية، حيث نركز على تحليل وتطوير العمليات، وتصميم الحلول الفعالة التي تدعم التحول الرقمي وتحسين الأداء المؤسسي. بفضل فهمنا العميق لاحتياجات السوق ومتطلبات الأعمال، نعمل جنبًا إلى جنب مع عملائنا لابتكار استراتيجيات تحقق قيمة مضافة حقيقية. رؤيتنا تتمثل في أن نكون الشريك الموثوق الذي يسهم في تطوير قطاع الأعمال من خلال تقديم حلول تواكب تطورات السوق وتعزز من نجاح عملائنا على المدى الطويل.',
    },
  ];

  i = 0;
  setI(i: number) {
    this.i = i;
  }

  img: string = 'images/about.png';
}
